### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [21]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [22]:
unique_SN = purchase_data.drop_duplicates(["SN"])
players_count = len(unique_SN)
Total_Player = pd.DataFrame({"Total Players": [players_count]})
Total_Player

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [23]:
item_count=len(purchase_data["Item Name"].unique())
Average_Price = purchase_data["Price"].mean()
purchase_count = len(purchase_data["Purchase ID"].unique())
total_revenue = purchase_data["Price"].sum()
Purchase_Analysis = pd.DataFrame({"Number of Unique Items": [item_count],
                                 "Average Price": [Average_Price],
                                 "Number of Purchase":[purchase_count],
                                 "Total Revenue":[total_revenue]})
Purchase_Analysis["Average Price"]=Purchase_Analysis["Average Price"].astype(float).map("${:,.2f}".format)
Purchase_Analysis["Total Revenue"]=Purchase_Analysis["Total Revenue"].astype(float).map("${:,.2f}".format)
Purchase_Analysis

   Number of Unique Items Average Price  Number of Purchase Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [24]:
gender_group = unique_SN.groupby("Gender")
num_of_each_gender = gender_group["Gender"].count()
gender_counts = pd.DataFrame(num_of_each_gender)
gender_counts = gender_counts.rename(columns={"Gender":"Total Count"})
gender_counts

                       Total Count
Gender
Female                          81
Male                           484
Other / Non-Disclosed           11

In [25]:
gender_percent = pd.DataFrame(num_of_each_gender/players_count)
gender_percent = gender_percent.rename(columns={"Gender":"Percentage of Players"})
gender_percent["Percentage of Players"]=gender_percent["Percentage of Players"].astype(float).map("{:,.2%}".format)
gender_percent

                      Percentage of Players
Gender
Female                               14.06%
Male                                 84.03%
Other / Non-Disclosed                 1.91%

In [26]:
Gender_Demographics = gender_counts.merge(gender_percent, on="Gender")
Gender_Demographics

                       Total Count Percentage of Players
Gender
Female                          81                14.06%
Male                           484                84.03%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [27]:

group = purchase_data.groupby("Gender")
Quantity = group["Gender"].count()
Purchase_Count = pd.DataFrame(Quantity)
Purchase_Count = Purchase_Count.rename(columns={"Gender":"Purchase Count"})
Purchase_Count

                       Purchase Count
Gender
Female                            113
Male                              652
Other / Non-Disclosed              15

In [28]:
price = group["Price"].sum()
Price_count = pd.DataFrame(price)
Price_count = Price_count.rename(columns={"Price":"Total Purchase Value"})
Price_count["Total Purchase Value"]=Price_count["Total Purchase Value"].astype(float).map("${:,.2f}".format)
Price_count

                      Total Purchase Value
Gender
Female                             $361.94
Male                             $1,967.64
Other / Non-Disclosed               $50.19

In [29]:
average = price/Quantity
Avg_Purchase_P = pd.DataFrame(average)
Avg_Purchase_P = Avg_Purchase_P.rename(columns={0:"Average Purchase Price"})
Avg_Purchase_P["Average Purchase Price"]=Avg_Purchase_P["Average Purchase Price"].astype(float).map("${:,.2f}".format)
Avg_Purchase_P

                      Average Purchase Price
Gender
Female                                 $3.20
Male                                   $3.02
Other / Non-Disclosed                  $3.35

In [30]:

average_pp = price/num_of_each_gender
ATP_PP = pd.DataFrame(average_pp)
ATP_PP = ATP_PP.rename(columns={0:"Avg Total Purchase per Person"})
ATP_PP["Avg Total Purchase per Person"]=ATP_PP["Avg Total Purchase per Person"].astype(float).map("${:,.2f}".format)
ATP_PP

                      Avg Total Purchase per Person
Gender
Female                                        $4.47
Male                                          $4.07
Other / Non-Disclosed                         $4.56

In [31]:
DF1 = Purchase_Count.merge(Avg_Purchase_P,on="Gender")
DF2 = DF1.merge(Price_count, on="Gender")
Purchasing_Analysis_G = DF2.merge (ATP_PP, on="Gender")
Purchasing_Analysis_G

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [32]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 200]
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
age_group = pd.cut(unique_SN["Age"], bins, labels=group_labels)
age_group

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
773    20-24
774    10-14
775    20-24
777    20-24
778      <10
Name: Age, Length: 576, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [33]:
unique_SN["Age Group"] = pd.cut(unique_SN["Age"], bins, labels=group_labels)
unique_SN.head()

<ipython-input-33-1ac2d4063ba7>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  unique_SN["Age Group"] = pd.cut(unique_SN["Age"], bins, labels=group_labels)

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [34]:
# Create a GroupBy object based upon "View Group"
unique_SN = unique_SN.groupby("Age Group")

# Find how many rows fall into each bin
age_group_count = pd.DataFrame(unique_SN["SN"].count())
age_group_count = age_group_count.rename(columns={"SN":"Total Count"})
age_group_count

# Get the average of each column within the GroupBy object

           Total Count
Age Group
<10                 17
10-14               22
15-19              107
20-24              258
25-29               77
30-34               52
35-39               31
40+                 12

In [37]:

age_group_percent = pd.DataFrame(age_group_count/players_count)
age_group_percent = age_group_percent.rename(columns={"Total Count":"Percentage of Players"})
age_group_percent["Percentage of Players"]=age_group_percent["Percentage of Players"].astype(float).map("{:,.2%}".format)
age_group_percent

          Percentage of Players
Age Group
<10                       2.95%
10-14                     3.82%
15-19                    18.58%
20-24                    44.79%
25-29                    13.37%
30-34                     9.03%
35-39                     5.38%
40+                       2.08%

In [40]:
Age_Demographics = age_group_count.merge(age_group_percent, on = "Age Group")
Age_Demographics

           Total Count Percentage of Players
Age Group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80